Repository: goncalofileno/ILMfinalProject
Catalog: Frontend/projecto_ilm_frontend/src/locales/*/messages.po
Languages: pt

source: <0>All </0><1>Users</1>
pt: <0>Todos os </0><1>Utilizadores</1>

source: <0>Project </0><1>Creation</1>
pt: <0>Criação de </0><1>Projeto</1>

source: Accept
pt: Aceitar

source: Actions
pt: Ações

source: Add
pt: Adicionar

source: Add a skill
pt: Adicionar uma Skill

source: Add New Dependent Task
pt: Adicionar Tarefa dependente

source: Add New Member
pt: Adicionar novo Membro

source: Add New Task
pt: Adicionar nova Tarefa

source: Add Project
pt: Adicionar Projecto

source: Add Resource
pt: Adicionar Resource

source: All
pt: Todos

source: todos-os-projectos-all
pt: Todos os

source: All Brands
pt: Todas as Marcas

source: All Labs
pt: Todos os Labs

source: All Status
pt: Todos os Status

source: All Suppliers
pt: Todos os Fornecedores

source: All Types
pt: Todos os Tipos

source: An error occurred while accepting the application.
pt: Ocorreu um erro ao aceitar a candidatura.

source: An error occurred while approving the project.
pt: Ocorreu um erro ao aprovar o projecto.

source: An error occurred while canceling the project.
pt: Ocorreu um erro ao cancelar o projeto.

source: An error occurred while changing user role.
pt: Ocorreu um erro a alterar a função do utilizador.

source: An error occurred while fetching the profile.
pt: Ocorreu um erro a obter o perfil do utilizador.

source: An error occurred while fetching users.
pt: Ocorreu um erro a obter os utilizadores.

source: An error occurred while inviting the user.
pt: Ocorreu um erro a convidar o utilizador.

source: An error occurred while joining the project.
pt: Ocorreu um erro a candidatares-te a um projeto.

source: An error occurred while leaving the project.
pt: Ocorreu um erro a abandonar o projeto.

source: An error occurred while marking the reason as read.
pt: Ocorreu um erro a marcar a razão como lida.

source: An error occurred while rejecting the application.
pt: Ocorreu um erro a rejeitar a candidatura.

source: An error occurred while rejecting the invite.
pt: Ocorreu um erro a rejeitar o convite.

source: An error occurred while rejecting the project.
pt: Ocorreu um erro a rejeitar um projeto.

source: An error occurred while removing the user.
pt: Ocorreu um erro a remover o utilizador.

source: An error occurred while responding to the invite.
pt: Ocorreu um erro a responder ao convite.

source: An error occurred while updating the project state.
pt: Ocorreu um erro ao alterar o estado do projeto.

source: An error occurred. Please try again.
pt: Aconteceu algo errado. Tente novamente.

source: Appliance Pending
pt: Candidatura Pendente

source: Applications
pt: Candidaturas

source: Approve Project
pt: Aprovar Projeto

source: Approved
pt: Aprovado

source: Are you sure you want to delete this mail?
pt: Tem a certeza que pretende eliminar este email?

source: Are you sure you want to delete this task?
pt: Tem a certeza que pretende eliminar esta tarefa?

source: Are you sure you want to promote this user to Admin?
pt: Tem a certeza que prentende promover este utilizador a Administrador?

source: Are you sure you want to reject this invite?
pt: Tem a certeza que pretende rejeitar este convite?

source: Ascending
pt: Ascendente

source: At least one lowercase letter
pt: Pelo menos um caracter minusculo

source: At least one number
pt: Pelo menos um digito

source: At least one special character (!@#$%^&*)
pt: Pelo menos um caracter especial (!@#$%^&*)

source: At least one uppercase letter
pt: Pelo menos um caracter maiusculo

source: Available Users
pt: Utilizadores Disponíveis

source: Average users in project
pt: Número médio de utilizadores por projeto

source: Bio
pt: Sobre

source: Brand
pt: Marca

source: Cancel
pt: Cancelar

source: Cancel Project
pt: Cancelar Projeto

source: Canceled
pt: Cancelado

source: Change Password
pt: Alterar Password

source: Checking...
pt: Verificando...

source: Clear
pt: Limpar

source: Clear Filters
pt: Limpar Filtros

source: Clear Search
pt: Limpar Pesquisa

source: Close
pt: Fechar

source: Completed tasks
pt: Tarefas completas

source: Compose New Mail
pt: Escrever novo Email

source: Confirm
pt: Confirmar

source: Confirm Cancel
pt: Confirmar Cancelamento

source: Confirm Delete
pt: Confirmar eliminação

source: Confirm Leave
pt: Confirmar Abandono

source: Confirm New Password
pt: Confirmar Nova Password

source: Confirm Password
pt: Confirme a Password

source: Confirm Reject
pt: Confirmar Rejeição

source: Confirm Rejection
pt: Confirmar Rejeição

source: Confirm Remove
pt: Confirmar Remoção

source: Confirm User Promotion to Admin
pt: Confirmação de Promoção a Administrador

source: Contact
pt: Contacto

source: Contact does not exist.
pt: O Contacto não existe.

source: Create
pt: Criar

source: Create Note
pt: Criar Nota

source: Create Profile
pt: Criar Perfil

source: Create Project
pt: Criar Projeto

source: Creator
pt: Criador

source: Current Password
pt: Password Atual

source: Date
pt: Data

source: Date:
pt: Data:

source: Day
pt: Dia

source: day(s)
pt: dia(s)

source: Delete
pt: Eliminar

source: Delete Task
pt: Eliminar Task

source: Dependencies
pt: Dependências

source: Dependent Tasks
pt: Tarefas Dependentes

source: Descending
pt: Descendente

source: Description
pt: Descrição

source: DONE
pt: COMPLETA

source: Duration
pt: Duração

source: Edit
pt: Editar

source: Edit Profile
pt: Editar Perfil

source: Edit Project
pt: Editar Projeto

source: Edit Task
pt: Editar Tarefa

source: Email is valid
pt: Email é válido

source: Email not found
pt: Email não encontrado

source: End date
pt: Data Final

source: End Date
pt: Data Final

source: End date must be after start date
pt: A data final deve ser após a data inicial

source: Enter contact name or email
pt: Escreva nome ou email

source: Enter subject
pt: Assunto

source: Enter your email
pt: Insira o seu email

source: Enter your message
pt: Escreva a sua mensagem

source: Error
pt: Erro

source: Error changing password.
pt: Erro ao alterar password.

source: Error creating profile
pt: Erro ao criar perfil

source: Error sending password reset email
pt: Erro no envio de mail para reset de password

source: Error updating profile
pt: Error ao alterar perfil

source: Error uploading profile picture
pt: Error ao carregar foto de perfil

source: Error while creating project
pt: Erro ao criar projeto

source: Error while updating project
pt: Erro ao alterar projeto

source: Export to PDF
pt: Extrair PDF

source: Failed to fetch projects. Please try again.
pt: Erro ao obter projetos. Tente novamente.

source: Failed to invite user. Please try again.
pt: Falha ao convidar utilizador. Tente novamente.

source: Failed to send mail.
pt: Falha ao enviar ao email.

source: Fair
pt: Média

source: Final Date
pt: Data Final

source: Finished
pt: Terminado

source: First Name
pt: Primeiro Nome

source: First Name is required.
pt: O Primeiro Nome é obrigatório.

source: Forget Password
pt: Esqueceu a Password

source: Forgot your password
pt: Esqueceu-se da password?

source: From
pt: De

source: Good
pt: Boa

source: ILM Statistics
pt: Estatísticas ILM

source: In Charge
pt: Responsável

source: In Progress
pt: Em progresso

source: IN PROGRESS
pt: EM PROGRESSO

source: Inbox
pt: Caixa de Entrada

source: inbox-caixa-de-entrada
pt: Caixa de Entrada

source: Initial Date
pt: Data Inicial

source: Interests
pt: Interesses

source: Interests:
pt: Interesses:

source: Invalid data. Please try again.
pt: Dados inválidos. Tente novamente.

source: Invalid project name
pt: Nome de projeto inválido

source: Invitation
pt: Convite

source: Invite
pt: Convidar

source: Invite to Project
pt: Convidar para Projeto

source: Inviting...
pt: Convidando...

source: Join Project
pt: Candidatar a Projeto

source: Keywords:
pt: Palavras-chave:

source: Knowledge
pt: Conhecimento

source: Laboratory
pt: Laboratório

source: Last Name
pt: Último Nome

source: Last Name is required.
pt: O Último Nome é obrigatório.

source: Leave Project
pt: Abandonar Projecto

source: Legend
pt: Legenda

source: Load More
pt: Carregar mais

source: Loading...
pt: Carregando...

source: Location
pt: Localização

source: Login to see more details
pt: Faça login para mais detalhes

source: Mail Details
pt: Detalhes do Email

source: Mail sent successfully.
pt: Email enviado com sucesso.

source: Mark as Read
pt: Marcar como lida

source: Max Members
pt: Nº Máximo de Membros

source: Member
pt: Membro

source: Member Type
pt: Tipo de Membro

source: Members
pt: Membros

source: Members ({0}/{1})
pt: Membros ({0}/{1})

source: Members per Lab
pt: Membros por Lab

source: Message
pt: Mensagem

source: Minimum 8 characters
pt: 8 caracters no mínimo

source: Month
pt: Mês

source: Motivation
pt: Motivação

source: o-my-projects
pt: Os Meus

source: My Profile
pt: O meu Perfil

source: My Projects
pt: Meus Projetos

source: Name
pt: Nome

source: Name has to be at least 3 characters long
pt: O Nome tem de conter pelo menos 3 caracteres

source: Name has to be at most 35 characters long
pt: O nome não pode ultrapassar os 35 caracteres

source: New Password
pt: Nova Password

source: New passwords do not match.
pt: As Novas Passwords não coincidem.

source: Next
pt: Próximo

source: Next step
pt: Próximo Passo

source: No applications available.
pt: Sem candidaturas disponíveis.

source: No emails found matching your criteria.
pt: Não foi encontrado qualquer email.

source: No interests added yet.
pt: Sem interesses ainda adicionados.

source: No interests available.
pt: Sem interesses disponíveis.

source: No keyword added yet.
pt: Sem palavras-chave ainda adicionadas.

source: No keywords available.
pt: Sem palavras-chave disponíveis.

source: No more notifications
pt: Sem mais notificações

source: No notifications to show
pt: Sem notificações para mostrar

source: No projects available.
pt: Sem projetos disponíveis.

source: No projects found matching your criteria.
pt: Não foram encontrados projetos.

source: No requests or applications to show.
pt: Sem pedidos ou candidaturas disponíveis.

source: No resources found matching your criteria.
pt: Não foram encontrados Recursos.

source: No skills added yet.
pt: Sem skills ainda adicionadas.

source: No skills available.
pt: Sem skills disponíveis.

source: No users available to show based on the selected criteria.
pt: Sem utilizadores disponíveis.

source: None
pt: Nada

source: Note
pt: Nota

source: Notes
pt: Notas

source: Number of projects per status in each lab
pt: Número de Projetos por estado em cada Lab

source: Observations
pt: Observações

source: Office
pt: Lab

source: Office is required.
pt: O Lab é obrigatório.

source: Out Colaboration
pt: Colaboração Externa

source: Password is not strong enough.
pt: A Password não é forte o suficiente.

source: Password is strong
pt: A Password é forte

source: Password must be strong
pt: A Password deve ser forte

source: Password must contain:
pt: A Password deve conter:

source: Password reset email sent
pt: Email para reset de password enviado

source: Password Strength
pt: Força da Password

source: Password updated successfully.
pt: Password alterada com sucesso.

source: Passwords do not match
pt: As Passwords não coincidem

source: Passwords match
pt: As Passwords coincidem

source: Photo
pt: Foto

source: Plan
pt: Plano

source: PLANNED
pt: PLANEADA

source: Planned tasks
pt: Tarefas Planeadas

source: Planning
pt: Planeado

source: Please fill all the fields
pt: Por favor preencha todos os campos

source: Please fill in all fields.
pt: Por favor preencha todos os campos

source: Please fill in all required fields.
pt: Por favor preencha todos os campos obrigatórios.

source: Please select a .jpg or .png file.
pt: Selecione um ficheiro .jpg ou .png por favor.

source: Please select a maximum number of members value smaller or equal to 30
pt: Por favor selecione um número máximo de números menor ou igual que 30

source: Private profile
pt: Perfil Privado

source: Progress
pt: Progresso

source: Project
pt: Projeto

source: PROJECT
pt: PROJETO

source: Project Average execution time
pt: Tempo médio de execução de Projeto

source: Project created successfully
pt: Projeto criado com sucesso

source: Project Image
pt: Imagem de Projeto

source: Project Name
pt: Nome do Projeto

source: Project name already exists
pt: O nome do Projeto já existe

source: Project name available
pt: Nome Disponível

source: Project Progress
pt: Progresso do Projeto

source: Project updated successfully
pt: Projeto alterado com sucesso

source: Project:
pt: Projeto:

source: Projects
pt: Projetos

source: Projects per Lab
pt: Projetos por Lab

source: Projects Statistics
pt: Estatísticas de Projetos

source: Promote to Admin
pt: Promover a Administrador

source: Public Profile
pt: Perfil Público

source: Ready
pt: Pronto

source: Reason
pt: Razão

source: Reason for Rejection
pt: Razão de Rejeição

source: Reason for Removal
pt: Razão de Remoção

source: Reason of Cancellation
pt: Razão de Cancelamento

source: Reason of Reject
pt: Razão de Rejeição

source: Reason to leave the Project
pt: Razão de abandono de Projeto

source: Register
pt: Registo

source: Registered successfully. Please Verify your email.
pt: Registado com sucesso. Por favor verifique o seu email.

source: Reject
pt: Rejeitar

source: Reject Application
pt: Rejeitar Candidatura

source: Reject Project
pt: Rejeitar Projeto

source: Remove
pt: Remover

source: Remove Member
pt: Remover Membro

source: Reply
pt: Responder

source: Requests and Applications
pt: Pedidos e Candidaturas

source: Resource created successfully.
pt: Recurso criado com sucesso.

source: Resource Creation
pt: Criação de Recurso

source: Resource edited successfully.
pt: Recurso editado com sucesso.

source: Resource Edition
pt: Edição de Recurso

source: Resources
pt: Recursos

source: Save
pt: Guardar

source: Save changes
pt: Guardar alterações

source: Save Resources
pt: Guardar Recursos

source: Search
pt: Procurar

source: Search for project name
pt: Procure pelo nome do projecto

source: Search for resource
pt: Procurar por Recurso

source: Search for resources
pt: Procurar por Recurso

source: Search for title or description
pt: Procure por titulo ou descrição

source: Search for user
pt: Procurar por Utilizador

source: Search mails
pt: Procurar emails

source: Search resources
pt: Procura por recursos

source: Select a project
pt: Selecione um projeto

source: Select a type
pt: Selecione um tipo

source: Select Office
pt: Selecionar Laboratório

source: Select Project
pt: Selecione Projeto

source: Select Skill Type for
pt: Selecione o tipo da Skill para

source: Select Type
pt: Selecione Tipo

source: Send
pt: Enviar

source: Send Email
pt: Enviar Email

source: Sent e-Mails
pt: eMails Enviados

source: Sent Mails
pt: Emails Enviados

source: Serial Number
pt: Nº de Série

source: Session Timeout
pt: Sessão Expirada

source: Skill Type
pt: Tipo de Skill

source: Slots Available
pt: Vagas Disponíveis

source: Some of our projects
pt: Alguns dos nossos projetos

source: Some of our Projects
pt: Alguns dos nossos Projetos

source: Start date
pt: Data Inicial

source: Start Date
pt: Data Inicial

source: Start date must be after today's date
pt: A data de início deve ser depois da data atual

source: States to Change
pt: Status para Alteração

source: Statistics
pt: Estatísticas

source: Status:
pt: Estado:

source: Strong
pt: Forte

source: Subject
pt: Assunto

source: Submit
pt: Submeter

source: Supplier
pt: Fornecedor

source: Supplier Contact
pt: Contacto de Fornecedor

source: Take Flight
pt: Levantam Voo

source: Task title must be unique.
pt: O título da tarefa deve ser único.

source: Tasks in progress
pt: Tarefas em Progresso

source: The invite for the project: {projectName} was successfully rejected.
pt: O convite para o projeto: {projectName} foi rejeitado com sucesso.

source: The members have been added to the project successfully
pt: Os membros foram adicionados ao projeto com sucesso

source: The project is {0} and cannot be edited.
pt: O projeto está {0} e não pode ser modificado.

source: The project is {0} and no notes can be added or changes made.
pt: O projeto está {0} e notas não pode serem adicionadas.

source: The project is {0} and no tasks can be added or changes made.
pt: O projeto está {0 e não é possível adicionar novas tarefas ou editar.}

source: The project is {0}, and you can't change the resources in the project.
pt: O projeto está {0, e não pode alterar os recursos no mesmo.}

source: The project is canceled and no changes can be made.
pt: O projeto está cancelado e não podem ser feitas alterações.

source: The project is canceled, and the chat is disabled.
pt: O projeto está cancelado e o chat está desativado.

source: The resources have been added to the project successfully
pt: Os recursos foram adicionados ao projeto com sucesso.

source: The resources have been saved successfully!
pt: Os recursos foram salvos com sucesso!

source: The team is full, no more members can be invited or accepted until the team has an available slot.
pt: A equipa de projeto está cheia, mais nenhum membro pode ser aceite ou convidado até abertura de vaga.

source: This email is invalid
pt: Este mail é inválido

source: This profile is private.
pt: Este perfil é privado.

source: This project is ready for approval
pt: O projeto está pronto para aprovação.

source: This resource already exists.
pt: Este recurso já existe.

source: This user has a private profile.
pt: Este utilizador tem o perfil privado.

source: Title
pt: Título

source: To
pt: Para

source: Tools
pt: Ferramentas

source: Total users
pt: Total de Utilizadores

source: Type
pt: Tipo

source: Type a message...
pt: Digite uma mensagem...

source: Type of Application:
pt: Tipo de Candidatura:

source: Type your note here. Use @ to mention a task.
pt: Escreva a sua nota. Use @ para mencionar uma tarefa.

source: Unauthorized: Invalid session.
pt: Proibido: Sessão Inválida.

source: Unread only
pt: Não lidos

source: Update Project
pt: Alterar Projeto

source: User
pt: Utilizador

source: User invited successfully!
pt: Utilizador convidado com sucesso!

source: User not found.
pt: Utilizadores não encontrados.

source: Users
pt: Utilizadores

source: Users in Project
pt: Membros no Projeto

source: Very Strong
pt: Muito Forte

source: View Mode
pt: Modo de Vizualização

source: Weak
pt: Fraca

source: Welcome to our Innovation Lab Management app, where creativity meets collaboration and ideas turn into reality. With our app, you can manage and track your projects seamlessly, from brainstorming to implementation, ensuring every idea has the potential to flourish. Join us in driving progress and inspiring change, one innovative project at a time.
pt: Bem-vindo à nossa aplicação de Gestão do Laboratório de Inovação, onde a criatividade encontra a colaboração e as ideias se tornam realidade. Com a nossa aplicação, pode gerir e acompanhar os seus projetos de forma eficiente, desde a conceção até à implementação, garantindo que cada ideia tem o potencial de florescer. Junte-se a nós na promoção do progresso e na inspiração de mudanças, um projeto inovador de cada vez.

source: Where Ideas
pt: Onde as Ideias

source: Year
pt: Ano

source: You
pt: Tu

source: You are a member of this project.
pt: És membro deste projeto.

source: You have applied to this project. You will be notified when one of the managers responds to your application.
pt: Já te candidataste a este projeto. Serás notificado quando um dos gestores responder à tua candidatura.

source: You have been invited to join this project.
pt: Foste convidado para integrar neste projeto.

source: You have exceeded the maximum number of members
pt: Excedeu o número máximo de membros

source: You now belong to the project: {projectName}.
pt: Agora pertences ao projeto: {projectName}

source: you-caixa-de-entrada
pt: A tua

source: os-teus-emails-enviados
pt: Os teus

source: Your account has been successfully confirmed!
pt: A tua conta foi confirmada com sucesso

source: Your Projects
pt: Os teus Projetos

source: Your Resources
pt: Os Recursos do Projeto

source: Your session has expired due to inactivity. Please log in again.
pt: A sua sessão expirou por falta de atividade. Faça login novamente.
